app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
     redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaa"], ["body", "aaaa"], ["created_at", "2021-10-03 05:34:10.152460"], ["updated_at", "2021-10-03 05:34:10.152460"]]
SELECT "books".* FROM "books"